# Vasilii Sitdikov
# GeekBrains Courses. Python Essential
# Lesson 2 task 3
# October 2019

# task: 3)	Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года
# относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.

# ----------------------------------------------------------------------------------------------------------------------
# Solution 1 (list):
seasons = ['зима', 'весна', 'лето', 'осень']
month = int(input('Введите номер месяца от 1 до 12: '))
month = month % 12  # Декабрь будет с номером 0
print(f'Сейчас {seasons[month // 3]}. Приятной прогулки!')

# ----------------------------------------------------------------------------------------------------------------------
# Solution 2 (dict):
seasons = {'зима': [12, 1, 2], 'весна': [3, 4, 5], 'лето': [6, 7, 8], 'осень': [9, 10, 11]}
month = int(input('Введите номер месяца от 1 до 12: '))
for key, value in seasons.items():
    if month in value:
        print(f'Сейчас {key}. Приятной прогулки!')
# ----------------------------------------------------------------------------------------------------------------------